In [7]:
import pandas as pd

In [8]:
data={'stat':['ohio','ohio','ohio','nevada','nevada','nevada'],
     'year':[2000,2001,2002,2001,2002,2003],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [9]:
frame=pd.DataFrame(data)

In [10]:
frame

     stat  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [11]:
type(frame)

pandas.core.frame.DataFrame

In [12]:
frame.shape

(6, 3)

In [14]:
frame.shape[1]

3

In [21]:
frame.head(6)

     stat  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [22]:
frame.tail(3)

     stat  year  pop
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [23]:
frame

     stat  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [24]:
pd.DataFrame(data,columns=['year','stat','pop'])

   year    stat  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9
5  2003  nevada  3.2

In [25]:
frame1=pd.DataFrame(data,columns=['year','stat','pop'],
                   index=['one','two','three','four','five','six'])

In [26]:
frame1

       year    stat  pop
one    2000    ohio  1.5
two    2001    ohio  1.7
three  2002    ohio  3.6
four   2001  nevada  2.4
five   2002  nevada  2.9
six    2003  nevada  3.2

In [30]:
frame2=pd.DataFrame(data,columns=['year','stat'],
                   index=['one','two','three','four','five','six'],
                   dtype=None)

In [31]:
frame2

       year    stat
one    2000    ohio
two    2001    ohio
three  2002    ohio
four   2001  nevada
five   2002  nevada
six    2003  nevada

In [54]:
frame3 = pd.DataFrame(data,columns=['year','pop','stat','dept'],
                     index=['one','two','three','four','five','six'])

In [55]:
frame3

       year  pop    stat dept
one    2000  1.5    ohio  NaN
two    2001  1.7    ohio  NaN
three  2002  3.6    ohio  NaN
four   2001  2.4  nevada  NaN
five   2002  2.9  nevada  NaN
six    2003  3.2  nevada  NaN

In [34]:
frame3.dept

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: dept, dtype: object

In [35]:
frame3['dept']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: dept, dtype: object

In [36]:
frame3.columns

Index(['year', 'pop', 'stat', 'dept'], dtype='object')

In [37]:
frame3.loc['three']

year    2002
pop      3.6
stat    ohio
dept     NaN
Name: three, dtype: object

In [38]:
frame3

       year  pop    stat dept
one    2000  1.5    ohio  NaN
two    2001  1.7    ohio  NaN
three  2002  3.6    ohio  NaN
four   2001  2.4  nevada  NaN
five   2002  2.9  nevada  NaN
six    2003  3.2  nevada  NaN

In [40]:
frame3.T

       one   two three    four    five     six
year  2000  2001  2002    2001    2002    2003
pop    1.5   1.7   3.6     2.4     2.9     3.2
stat  ohio  ohio  ohio  nevada  nevada  nevada
dept   NaN   NaN   NaN     NaN     NaN     NaN

In [41]:
frame3.dept

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: dept, dtype: object

In [56]:
frame3.dept=16.5

In [57]:
frame3

       year  pop    stat  dept
one    2000  1.5    ohio  16.5
two    2001  1.7    ohio  16.5
three  2002  3.6    ohio  16.5
four   2001  2.4  nevada  16.5
five   2002  2.9  nevada  16.5
six    2003  3.2  nevada  16.5

In [58]:
import numpy as np

In [59]:
frame3['dept']=np.arange(6.)

In [60]:
frame3

       year  pop    stat  dept
one    2000  1.5    ohio   0.0
two    2001  1.7    ohio   1.0
three  2002  3.6    ohio   2.0
four   2001  2.4  nevada   3.0
five   2002  2.9  nevada   4.0
six    2003  3.2  nevada   5.0

In [61]:
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [62]:
frame3.dept=val

In [63]:
frame3

       year  pop    stat  dept
one    2000  1.5    ohio   NaN
two    2001  1.7    ohio  -1.2
three  2002  3.6    ohio   NaN
four   2001  2.4  nevada  -1.5
five   2002  2.9  nevada  -1.7
six    2003  3.2  nevada   NaN

In [64]:
frame3['estearn']=frame3.stat=='ohio'

In [65]:
frame3

       year  pop    stat  dept  estearn
one    2000  1.5    ohio   NaN     True
two    2001  1.7    ohio  -1.2     True
three  2002  3.6    ohio   NaN     True
four   2001  2.4  nevada  -1.5    False
five   2002  2.9  nevada  -1.7    False
six    2003  3.2  nevada   NaN    False

In [69]:
del frame3['estearn']

In [70]:
frame3

       year  pop    stat  dept
one    2000  1.5    ohio   NaN
two    2001  1.7    ohio  -1.2
three  2002  3.6    ohio   NaN
four   2001  2.4  nevada  -1.5
five   2002  2.9  nevada  -1.7
six    2003  3.2  nevada   NaN

In [71]:
pop = {'nevada':{2001:2.4,2002:2.9},
      'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [72]:
frame4=pd.DataFrame(pop)

In [73]:
frame4

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [74]:
frame4.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

In [75]:
pd.DataFrame(pop,index=[2001,2002,2003])

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [83]:
pdata={'ohio':frame3['stat']=='ohio'[:-1],
       'nevada':frame3['stat']=='nevada'[:2]}

In [84]:
pd.DataFrame(pdata)

        ohio  nevada
one    False   False
two    False   False
three  False   False
four   False   False
five   False   False
six    False   False

In [85]:
frame3

       year  pop    stat  dept
one    2000  1.5    ohio   NaN
two    2001  1.7    ohio  -1.2
three  2002  3.6    ohio   NaN
four   2001  2.4  nevada  -1.5
five   2002  2.9  nevada  -1.7
six    2003  3.2  nevada   NaN

In [86]:
frame3.columns.name='stat'
frame3.index. name='year'

In [87]:
frame3

stat   year  pop    stat  dept
year
one    2000  1.5    ohio   NaN
two    2001  1.7    ohio  -1.2
three  2002  3.6    ohio   NaN
four   2001  2.4  nevada  -1.5
five   2002  2.9  nevada  -1.7
six    2003  3.2  nevada   NaN

In [88]:
frame3.values

array([[2000, 1.5, 'ohio', nan],
       [2001, 1.7, 'ohio', -1.2],
       [2002, 3.6, 'ohio', nan],
       [2001, 2.4, 'nevada', -1.5],
       [2002, 2.9, 'nevada', -1.7],
       [2003, 3.2, 'nevada', nan]], dtype=object)